In [1]:
import os
import pandas as pd
from sqlalchemy import create_engine
import numpy as np

In [4]:
from dotenv import load_dotenv
load_dotenv()

True

In [5]:
username = os.getenv('POSTGRES_USERNAME')
password = os.getenv('POSTGRES_PASSWORD')


postgres_connection_string = "postgres://{username}:{password}@{host}:{port}/{database}?gssencmode=disable".format(
    username=username,
    password=password,
    host="localhost",
    port="5432",
    database="lahman_baseball"
)

In [7]:
engine = create_engine(postgres_connection_string)

In [27]:
people_sql = "SELECT * FROM people;"
salaries_sql = "SELECT * FROM salaries;"
homegames_sql = "SELECT * FROM homegames;"
parks_sql = "SELECT * FROM parks;"

In [28]:
people_df = pd.read_sql(people_sql, con=engine)
salaries_df = pd.read_sql(salaries_sql, con=engine)
homegames_df = pd.read_sql(homegames_sql, con=engine)
parks_df = pd.read_sql(parks_sql, con=engine)

In [29]:
homegames_df.loc[homegames_df['attendance'].idxmax()]

year                1993
league                NL
team                 COL
park               DEN01
span_first    1993-04-09
span_last     1993-09-26
games                 81
openings              79
attendance       4483203
Name: 2278, dtype: object

In [30]:
salaries_df.head()

   yearid teamid lgid   playerid    salary
0    1985    ATL   NL  barkele01  870000.0
1    1985    ATL   NL  bedrost01  550000.0
2    1985    ATL   NL  benedbr01  545000.0
3    1985    ATL   NL   campri01  633333.0
4    1985    ATL   NL  ceronri01  625000.0

In [31]:
salaries_df.loc[salaries_df['salary'].idxmax()]

yearid           2009
teamid            NYA
lgid               AL
playerid    rodrial01
salary        3.3e+07
Name: 20286, dtype: object

In [32]:
salaries_df.sort_values(by = ['salary'], ascending = False)

       yearid teamid lgid   playerid      salary
25965    2016    LAN   NL  kershcl01  33000000.0
20286    2009    NYA   AL  rodrial01  33000000.0
21109    2010    NYA   AL  rodrial01  33000000.0
25131    2015    LAN   NL  kershcl01  32571000.0
21945    2011    NYA   AL  rodrial01  32000000.0
...       ...    ...  ...        ...         ...
9679     1997    FLO   NL   penaal01     50000.0
6659     1994    CHA   AL   carych01     50000.0
6194     1993    NYA   AL  silveda01     10900.0
12007    1999    PIT   NL  martija02         0.0
6179     1993    NYA   AL  jamesdi01         0.0

[26428 rows x 5 columns]

## Clean up the connection!

In [ ]:
#engine.dispose()